; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v3 ?v11)
             (pred_2 ?v10 ?v2)
             (pred_6 ?v3 ?v2)
             (pred_1 ?v7 ?v3 )
	     (pred_5 ?v3)
             (pred_3 ?v9)
             (pred_8 ?v10)
             (pred_12 ?v2)
             (pred_10 ?v3)
             (pred_9 ?v10)
             (pred_4 ?v3)
             (pred_7 ))



(:action op_3
:parameters (?v5 ?v1 ?v6 ?v12)
:precondition (and (pred_3 ?v5) (pred_3 ?v1) (pred_8 ?v6) (pred_12 ?v12)
          (pred_11 ?v5 ?v1) (pred_2 ?v6 ?v12)
                   (pred_6 ?v1 ?v12) (pred_5 ?v5) 
                   (pred_10 ?v1) (pred_9 ?v6))
:effect (and  (pred_4 ?v1) (not (pred_10 ?v1))))


(:action op_5
:parameters (?v5 ?v13)
:precondition (and (pred_3 ?v5) (pred_3 ?v13)
               (pred_5 ?v5) (pred_11 ?v5 ?v13) (pred_4 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v5))))

(:action op_1
:parameters (?v5 ?v6)
:precondition (and (pred_3 ?v5) (pred_8 ?v6) 
                  (pred_5 ?v5) (pred_1 ?v6 ?v5) (pred_7 ))
:effect (and (pred_9 ?v6)
   (not (pred_1 ?v6 ?v5)) (not (pred_7 ))))


(:action op_4
:parameters (?v5 ?v4 ?v8)
:precondition (and (pred_3 ?v5) (pred_8 ?v4) (pred_8 ?v8)
                  (pred_5 ?v5) (pred_9 ?v8) (pred_1 ?v4 ?v5))
:effect (and (pred_9 ?v4) (pred_1 ?v8 ?v5)
        (not (pred_9 ?v8)) (not (pred_1 ?v4 ?v5))))

(:action op_2
:parameters (?v5 ?v6)
:precondition (and (pred_3 ?v5) (pred_8 ?v6) 
                  (pred_5 ?v5) (pred_9 ?v6))
:effect (and (pred_7 ) (pred_1 ?v6 ?v5) (not (pred_9 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_12 obj_10 obj_17 obj_15 obj_03 obj_20 obj_06 obj_04 obj_02 obj_19 obj_05 obj_09 obj_07 obj_18 obj_08
    obj_14 obj_16
    obj_01 obj_11
    )

    (:init
       (pred_7)

       (pred_3 obj_13)
       (pred_3 obj_12)
       (pred_3 obj_10)
       (pred_3 obj_17)
       (pred_3 obj_15)
       (pred_3 obj_03)
       (pred_3 obj_20)
       (pred_3 obj_06)
       (pred_3 obj_04)
       (pred_3 obj_02)
       (pred_3 obj_19)
       (pred_3 obj_05)
       (pred_3 obj_09)
       (pred_3 obj_07)
       (pred_3 obj_18)
       (pred_3 obj_08)
       (pred_12 obj_14)
       (pred_12 obj_16)
       (pred_8 obj_01)
       (pred_8 obj_11)

       (pred_11 obj_13 obj_15)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_12 obj_03)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_10 obj_20)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_17 obj_06)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_15 obj_04)
       (pred_11 obj_15 obj_03)
       (pred_11 obj_15 obj_13)
       (pred_11 obj_03 obj_02)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_12)
       (pred_11 obj_03 obj_15)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_20 obj_10)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_06 obj_17)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_04 obj_15)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_19)
       (pred_11 obj_02 obj_03)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_02)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_09 obj_07)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_07 obj_02)
       (pred_11 obj_07 obj_09)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_08 obj_18)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_6  obj_08 obj_14)
       (pred_6  obj_05 obj_16)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_17)
       (pred_4 obj_15)
       (pred_4 obj_03)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_04)
       (pred_4 obj_02)
       (pred_4 obj_19)
       (pred_4 obj_09)
       (pred_4 obj_07)
       (pred_4 obj_18)

       (pred_2  obj_01 obj_14)
       (pred_2  obj_11 obj_16)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_11 obj_09)
       (pred_5 obj_03)
    )

    (:goal (and
       (pred_1 obj_01 obj_17)
    ))
(:constraints
  (always (not (pred_5 obj_12)))
)
)

; plan
1. (op_5 obj_03 obj_20)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_20)
   goals met: 0 of 1
2. (op_5 obj_20 obj_10)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_10)
   goals met: 0 of 1
3. (op_1 obj_10 obj_01)
   deleted: (pred_1 obj_01 obj_10) (pred_7)
   added: (pred_9 obj_01)
   goals met: 0 of 1
4. (op_5 obj_10 obj_17)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_17)
   goals met: 0 of 1
5. (op_2 obj_17 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_7) (pred_1 obj_01 obj_17)
   goals met: 1 of 1
